Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs-shipyard</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_file.this["ecosystem-dashboard/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "ecosystem-dashboard"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["go-ipfs-desktop/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "go-ipfs-desktop"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["go-libp2p-kitsune/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "go-libp2p-kitsune"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["gomobile-ipfs/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "gomobile-ipfs"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["ipfs-deploy/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "ipfs-deploy"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["ipfs-or-gateway/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "ipfs-or-gateway"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["java-ipfs-http-client/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "java-ipfs-http-client"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-mock-ipfs-pinning-service/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-mock-ipfs-pinning-service"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["net-ipfs-core/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "net-ipfs-core"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["net-ipfs-http-client/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "net-ipfs-http-client"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["nopfs/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "nopfs"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["pinning-service-compliance/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "pinning-service-compliance"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["space/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "space"
      + sha                 = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->